# Built In Failures Electrical Failures Not Enough Avail Slots On Panel Property

Source: https://www.revitapidocs.com/2026/592744db-773f-36e5-e5b6-63ec6fab970d.htm

---

| Built In Failures Electrical Failures Not Enough Avail Slots On Panel Property |
| --- |

You can't connect to panel \[Panel Name] because there aren't enough slots. \\nYou can increase the \[ParameterName] to be greater than \[Number] to connect through breaker slots or open the panel schedule and manually reshuffle non \- consecutive slots.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId NotEnoughAvailSlotsOnPanel { get; }
```

```
Public Shared ReadOnly Property NotEnoughAvailSlotsOnPanel As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ NotEnoughAvailSlotsOnPanel {
	FailureDefinitionId^ get ();
}
```

```
static member NotEnoughAvailSlotsOnPanel : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ElectricalFailures Class Autodesk.Revit.DB Namespace